Tekla Open API Reference for Tekla Structures 2025
MeshCatalog Events
The MeshCatalog type exposes the following members.
Events
Name | Description
SelectClicked
 The SelectClicked event is raised when the Select button is clicked.
SelectionDone
 The SelectionDone event is raised when the selection has been done.
Top
See Also
Reference
MeshCatalog Class
Tekla.Structures.Dialog.UIControls Namespace